{
  "_name_or_path": "FacebookAI/xlm-roberta-large",
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "Analyst Update",
    "1": "Fed | Central Banks",
    "10": "Gold | Metals | Materials",
    "11": "IPO",
    "12": "Legal | Regulation",
    "13": "M&A | Investments",
    "14": "Macro",
    "15": "Markets",
    "16": "Politics",
    "17": "Personnel Change",
    "18": "Stock Commentary",
    "19": "Stock Movement",
    "2": "Company | Product News",
    "3": "Treasuries | Corporate Debt",
    "4": "Dividend",
    "5": "Earnings",
    "6": "Energy | Oil",
    "7": "Financials",
    "8": "Currencies",
    "9": "General News | Opinion"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "Analyst Update": 0,
    "Company | Product News": 2,
    "Currencies": 8,
    "Dividend": 4,
    "Earnings": 5,
    "Energy | Oil": 6,
    "Fed | Central Banks": 1,
    "Financials": 7,
    "General News | Opinion": 9,
    "Gold | Metals | Materials": 10,
    "IPO": 11,
    "Legal | Regulation": 12,
    "M&A | Investments": 13,
    "Macro": 14,
    "Markets": 15,
    "Personnel Change": 17,
    "Politics": 16,
    "Stock Commentary": 18,
    "Stock Movement": 19,
    "Treasuries | Corporate Debt": 3
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.48.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
