{
  "_name_or_path": "google-bert/bert-large-cased-whole-word-masking",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "analyse mutual fund",
    "1": "analyse stock",
    "2": "customer service",
    "3": "methodology",
    "4": "mutual fund screener",
    "5": "stock screener",
    "6": "tuntun aku",
    "7": "wiki"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "analyse mutual fund": 0,
    "analyse stock": 1,
    "customer service": 2,
    "methodology": 3,
    "mutual fund screener": 4,
    "stock screener": 5,
    "tuntun aku": 6,
    "wiki": 7
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.48.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
